num_1 = 10
print("num_1", num_1, type(num_1))
num_2 = 3
result = num_1 / num_2
print("Result", result, type(result))

numbers = [1, 2, 3, 4, 5]
total = sum(numbers)
print("Sum", total)

print("To int", int(True))

# Операции с числами:
# +, -, *, /
# // - целочисленное деление
# % - остаток от деления
# ** - возведение в степень

# Функиции:
# abs(x) - возвращает абсолютное значение числа x
# round(x, n) - округляет число x до n знаков после запятой.
# max(x, y) - нахождения максимального значения из двух или более аргументов
# min(x, y) - используется для нахождения минимального значения из двух или более аргументов.
# sum(iterable, start=0) - используется для вычисления суммы элементов в итерируемом объекте,
# таком как список, кортеж или множество.
# int(x) - используется для преобразования значения в целое число (integer).
# float(x) - используется для преобразования значения в число с плавающей точкой (float).
