int_1 = 2
int_2 = 5
float_1 = 10.5
float_2 = -1.5
str_1 = "Hello"
str_2 = " world"
result_int = int_1 + int_2
result_float = float_1 + float_2
result_str = str_1 + str_2
print(result_int, result_float, result_str)
boolean_1 = True
boolean_2 = False

# Списки (list): Списки в Python представляют собой упорядоченные коллекции элементов, которые могут быть разных типов.
# Списки заключаются в квадратные скобки [ ].
fruits_list = ['apple', 'banana', 'cherry']
numbers_list = [1, 2, 3, 4, 5]

# Кортежи (tuple): Кортежи в Python представляют собой неизменяемые упорядоченные коллекции элементов.
# Они заключаются в круглые скобки ().
point_tuple = (2, 3)
person_tuple = ('John', 30, 'Engineer')

# Диапазоны (range): Диапазоны в Python представляют собой последовательность целых чисел.
# Они создаются с помощью функции range().
numbers_range = range(1, 11) # Диапазон от 1 до 10

# Python также предоставляет словарный тип данных dict,
# который представляет собой неупорядоченную коллекцию пар ключ-значение. Словари заключаются в фигурные скобки { }.
# Ключи в словаре должны быть уникальными и неизменяемыми (например, строки или числа),
# а значения могут быть любого типа данных.
person_dict = { 'name': 'John Doe', 'age': 30}